fonecmid-diplom/src/Documents/BKM_ОбслуживаниеКлиентов/BKM_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.BKM_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.BKM_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ПредоставленнаяУслуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/BKM_ВыполненныеКлиентуРаботы/BKM_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BKM_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/BKM_ВыполненныеСотрудникомРаботы/BKM_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BKM_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.BKM_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/BKM_ОбслуживаниеКлиентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

	Перем СообщениеТелеграммБоту; // СообщениеТелеграммБоту до записи объекта в базу  

#КонецОбласти

#Область ОбработчикиСобытий 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СообщениеТелеграммБоту = СформироватьСообщениеТелеграммБоту();
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
     	
     	Возврат;
     	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеТелеграммБоту) Тогда 
		СообщениеТелеграммБоту = СтрЗаменить(СообщениеТелеграммБоту,"№Заявки",ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер));
		Если Справочники.BKM_УведомленияТелеграмБоту.ДобавитьУведомление(СообщениеТелеграммБоту ) = Неопределено Тогда
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Формирование уведомления в справочнике. Запись не создана.", УровеньЖурналаРегистрации.Ошибка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьЗаполнениеОбъекта(Отказ); 
	
	// Проверить табличную часть на предмет заполнения выполненных работ.
	
	Если ВыполненныеРаботы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
Если Отказ Тогда	
		Возврат;	
	КонецЕсли; 
			
	Движения.BKM_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.BKM_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	ВсегоЧасовКОплатеКлиенту = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	СтавкаЧасаПоДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"BKM_СтоимостьЧасаРаботыСпециалиста");
    СуммаКОплатеКлиенту = ВсегоЧасовКОплатеКлиенту * СтавкаЧасаПоДоговору;
	
	//Движения по регистру BKM_ВыполненныеКлиентуРаботы 
	Движение = Движения.BKM_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ВсегоЧасовКОплатеКлиенту;
	Движение.СуммаКОплате = СуммаКОплатеКлиенту; 
	
	//Движения по регистру BKM_ВыполненныеСотрудникомРаботы 
	Движение = Движения.BKM_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Сотрудник = Специалист;
	Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов");
	Движение.СуммаКОплате = СуммаКОплатеКлиенту;
	
КонецПроцедуры
	

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеОбъекта(Отказ) 
    
    РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, ВКМ_ДатаНачалаДействияДоговора, ВКМ_ДатаОкончанияДействияДоговора");
    
    // Проверка вида договора
    Если РеквизитыДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание Тогда 
        
        ТекстСообщения = "Документ не проведен. Выбранный договор не предусматривает абононентского обслуживания.";
        
        ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект",Отказ);	
        
    Иначе
        
        // Проверка действия договора     
        
        Если РеквизитыДоговора.ВКМ_ДатаНачалаДействияДоговора > Дата Или РеквизитыДоговора.ВКМ_ДатаОкончанияДействияДоговора < Дата Тогда
            
            ТекстСообщения = "Документ не проведен. Выбранный договор не дейстителен на дату составления текущего документа.";
            
            ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект",Отказ);	
            
        КонецЕсли;
        
    КонецЕсли;  
                
КонецПроцедуры

Функция СформироватьСообщениеТелеграммБоту()
	
	ТекстСообщения = "";
	Если ЭтоНовый() Тогда
		
		ТекстСообщения = "Создана новая заявка на обслуживание клиента";
		
	Иначе
		
		СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
		"ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист");
		
		ИзмененныеРеквизиты = Новый Структура;
		ИзмененныеРеквизиты.Вставить("ДатаПроведенияРабот", ДатаПроведенияРабот);
		ИзмененныеРеквизиты.Вставить("ВремяНачалаРабот", ВремяНачалаРабот);
		ИзмененныеРеквизиты.Вставить("ВремяОкончанияРабот", ВремяОкончанияРабот);
		ИзмененныеРеквизиты.Вставить("Специалист", Специалист);
		
		Если  Не ОбщегоНазначения.ДанныеСовпадают(СтарыеРеквизиты, ИзмененныеРеквизиты) Тогда
			
			ТекстСообщения = "Произошли изменения в заявке на обслуживание клиента";
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ТекстСообщения <> "" Тогда
		
		ТекстСообщения = СтрШаблон("%1 №№Заявки от %2.
						|Контрагент %3.
						|Дата проведения работ запланирована на %4 с %5 по %6.
						|Назначен специалист: %7.",
						ТекстСообщения, 
						Формат(Дата,"ДФ=dd.MM.yyyy"), Клиент, Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy"),
						Формат(ВремяНачалаРабот,"ДФ=ЧЧ.мм"),Формат(ВремяОкончанияРабот,"ДФ=ЧЧ.мм"), Специалист);
		
	КонецЕсли;
	
    Возврат ТекстСообщения; 
	
КонецФункции

#КонецОбласти  

#КонецЕсли
